wsman-cli/src/test/resources/fixtures/runCmd/req1-create.xml

<?xml version="1.0" encoding="utf-8"?>
<env:Envelope xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:x="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" xmlns:cfg="http://schemas.microsoft.com/wbem/wsman/1/config" xmlns:b="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd" xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing">
	<env:Header>
		<a:Action mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/Create</a:Action>
		<a:MessageID>uuid:716f1a05-8d08-4a96-aaa2-49160f576e0a</a:MessageID>
		<w:OptionSet>
			<w:Option Name="WINRS_NOPROFILE">FALSE</w:Option>
			<w:Option Name="WINRS_CODEPAGE">437</w:Option>
		</w:OptionSet>
		<a:ReplyTo>
			<a:Address mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
		</a:ReplyTo>
		<w:MaxEnvelopeSize mustUnderstand="true">153600</w:MaxEnvelopeSize>
		<w:Locale mustUnderstand="false" xml:lang="en-US"/>
		<w:OperationTimeout>PT60S</w:OperationTimeout>
		<p:DataLocale mustUnderstand="false" xml:lang="en-US"/>
		<a:To>http://windows-host:5985/wsman</a:To>
		<w:ResourceURI mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd</w:ResourceURI>
	</env:Header>
	<env:Body>
		<rsp:Shell>
			<rsp:OutputStreams>stdout stderr</rsp:OutputStreams>
			<rsp:InputStreams>stdin</rsp:InputStreams>
		</rsp:Shell>
	</env:Body>
</env:Envelope>